#+Title: Configuration Management
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2025-04-02
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:1
#+STARTUP: beamer num

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH2025

* diff -- Vad Skiljer sig åt?
#+begin_src bash :results output
  cd /tmp
  echo "aaa" > first.txt ; echo "aaa" > second.txt
  echo "bbb" >> first.txt; echo "BBB" >> second.txt
  echo "ccc" >> first.txt; echo "ccc" >> second.txt
  echo "ddd" >> second.txt

  cat first.txt
  echo "----------"
  cat second.txt
  echo "----------"
  diff first.txt second.txt
#+end_src

#+RESULTS:
#+begin_example
aaa
bbb
ccc
----------
aaa
BBB
ccc
ddd
----------
2c2
< bbb
---
> BBB
3a4
> ddd
#+end_example

- Hur läser vi detta?
- Helst inte; det finns bra verktyg för det.

#+begin_src bash :results none
meld /tmp/first.txt /tmp/second.txt
#+end_src
